mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
        // reset signal path for gyroscope, accelerometer and temperature sensor
        BSP_MPU9150_writeSingleReg(inDevice,
                BSP_MPU9150_REG_SIGNAL_PATH_RESET,
                BSP_MPU9150_RESET_SIGNAL_PATH_VALUE,
                &err);
        nrf_delay_ms(30u);

        if(err == BSP_MPU9150_err_NONE) {
            // set PLL with X axis gyroscope reference (for better clock stability)
            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_PWR_MGMT_1,
                    BSP_MPU9150_PLL_REFERENCE_VALUE,
                    &err);
            // wait 2ms for PLL to settle (datasheet)
            nrf_delay_ms(2u);
        }

        if(err == BSP_MPU9150_err_NONE) {
            if(deviceId != BSP_MPU9150_DEVICE_ID_VALUE) {
                // device ID value read is not correct
                err = BSP_MPU9150_err_INIT;
            }
        }

        // configure sensors before start of sampling
        if(err == BSP_MPU9150_err_NONE) {
            BSP_MPU9150_configuration(inDevice, &err);
        }
        nrf_delay_ms(50u);

        if(err == BSP_MPU9150_err_NONE) {
            inDevice->isInitialized = true;
        }
    }

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Updates temperature, accelerometer, gyroscope data to buffer.
 ***************************************************************************************************
 * @param [in]  *inDevice   - pointer to device structure for MPU-9150 driver.
 * @param [in]  *newValues  - pointer to buffer that contains new updated values.
 * @param [out] *outErr     - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    01.06.2021
 **************************************************************************************************/
void BSP_MPU9150_updateValues(BSP_MPU9150_device_S *inDevice,
        int16_t *newValues,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E mpuErr = BSP_MPU9150_err_NONE;
    // buffer for raw register values
    uint8_t byteBuffer[BSP_MPU9150_READ_DATA_SIZE_IN_BYTES];
    int16_t accVals[6];
    int16_t gyroVals[6];
    int16_t temp = 0;

    BSP_MPU9150_readMultiReg(inDevice,
            BSP_MPU9150_REG_ACCEL_XOUT_H,
            BSP_MPU9150_READ_DATA_SIZE_IN_BYTES,
            &byteBuffer[0],
            &mpuErr);

    if(mpuErr == BSP_MPU9150_err_NONE) {
        BSP_MPU9150_calculateAccValues(inDevice, &byteBuffer[BSP_MPU9150_ACC_DATA_TWI_OFFSET], &accVals[0]);
        BSP_MPU9150_calculateTemperature(&byteBuffer[BSP_MPU9150_TEMP_DATA_TWI_OFFSET], &temp);
        BSP_MPU9150_calculateGyroValues(inDevice, &byteBuffer[BSP_MPU9150_GYRO_DATA_TWI_OFFSET], &gyroVals[0]);
        BSP_MPU9150_packDataToSend(&gyroVals[0], &accVals[0], temp, &newValues[0]);
    }

    if(outErr != NULL) {
        *outErr = mpuErr;
    }
}


void nrf_drv_mpu_twi_event_handler(nrf_drv_twi_evt_t const * p_event, void * p_context) {

    BSP_MPU9150_device_S *inDevice = (BSP_MPU9150_device_S *) p_context;

    switch(p_event->type) {
        case NRF_DRV_TWI_EVT_DONE:
            switch(p_event->xfer_desc.type) {
                case NRF_DRV_TWI_XFER_TX:
                    inDevice->twiTxDone = true;
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXTX:
                    twi_tx_done = true;
                    inDevice->twiTxDone = true;
                    break;
                case NRF_DRV_TWI_XFER_RX:
                    twi_rx_done = true;
                    inDevice->twiRxDone = true;
                    break;
                case NRF_DRV_TWI_XFER_TXRX:
                    twi_rx_done = true;
                    inDevice->twiRxDone = true;
                    break;
                default:
                    break;
            }
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            break;
        default:
            break;
    }
}

/***************************************************************************************************
 *                          PRIVATE FUNCTION DEFINITIONS
 **************************************************************************************************/
/***********************************************************************************************//**
 * @brief Function for writing to single register of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  regData      - data to be sent.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_writeSingleReg(BSP_MPU9150_device_S *inDevice,
        uint8_t regAddr,
        const uint8_t regData,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

    // assemble I2C data - 1 byte register address, 1 byte data
    uint8_t msg[BSP_MPU9150_SINGLE_REG_MSG_SIZE] = { regAddr, regData };

#if (DEPRECATED_TWI == false)
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &msg[0],
            BSP_MPU9150_SINGLE_REG_MSG_SIZE,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }

