mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
    twi_tx_done = false;

#else
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 0u, &msg[0], 2u, false);
#endif // (DEPRECATED_TWI == false)

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for writing to single register of MPU9150 magnetometer.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  regData      - data to be sent.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_writeSingleMagReg(BSP_MPU9150_device_S *inDevice,
        uint8_t regAddr,
        const uint8_t regData,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

    // assemble I2C data - 1 byte register address, 1 byte data
    uint8_t msg[BSP_MPU9150_SINGLE_REG_MSG_SIZE] = { regAddr, regData };

#if (DEPRECATED_TWI == false)
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuMagAddress,
            &msg[0],
            BSP_MPU9150_SINGLE_REG_MSG_SIZE,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }

    twi_tx_done = false;

#else
    twi_master_transfer((inDevice->config->mpuMagAddress << 1u) | 0u, &msg[0], 2u, false);
#endif // (DEPRECATED_TWI == false)

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from single register of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_readSingleReg(BSP_MPU9150_device_S *inDevice,
        uint8_t regAddr,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

#if (DEPRECATED_TWI == false)
    // after first START condition send |SLAVE_ADDR+W|REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &regAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_tx_done = false;

    // after second START condition read in data from register
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            data,
            1u);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_rx_done = false;

#else
    // TX first the reg address with write bit
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 0u, &regAddr, 1u, false);

    // RX data from register (single - 1 byte)
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 1u, data, 1u, false);
#endif // (DEPRECATED_TWI == false)

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from single register of MPU9150 magnetometer sensor.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
void BSP_MPU9150_readSingleMagReg(BSP_MPU9150_device_S *inDevice,
        uint8_t regAddr,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

#if (DEPRECATED_TWI == false)
    // after first START condition send |SLAVE_ADDR+W|REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuMagAddress,
            &regAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_tx_done = false;

    // after second START condition read in data from register
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuMagAddress,
            data,
            1u);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_rx_done = false;

#else
    // TX first the reg address with write bit
    twi_master_transfer((inDevice->config->mpuMagAddress << 1u) | 0u, &regAddr, 1u, false);

