mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
    outBuffer[3] = accVals[0];
    outBuffer[4] = accVals[1];
    outBuffer[5] = accVals[2];

    outBuffer[6] = temp;
}

/***********************************************************************************************//**
 * @brief Function sets up configuration registers for MPU-9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    16.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_configuration(BSP_MPU9150_device_S *inDevice, BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
    BSP_MPU9150_configReg_U configRegVal = { .R = 0u };
    BSP_MPU9150_gyroConfigReg_U gyroConfigReg = { .R = 0u };
    BSP_MPU9150_accConfigReg_U accConfigReg = { .R = 0u };
    BSP_MPU9150_intConfigReg_U intConfigReg = { .R = 0u };
    BSP_MPU9150_fifoConfigReg_U fifoConfigReg = { .R = 0u };
    BSP_MPU9150_intEnableReg_U intEnableReg = { .R = 0u };

    if(inDevice != NULL) {
        /*
         * Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV), where Gyroscope Output Rate
         * can be either 8kHz when DLPF is disabled, or 1kHz when DLPF is enabled
         */

        // worked with 199, 143
        uint8_t samplingRateRegVal = 9u;
        BSP_MPU9150_writeSingleReg(inDevice,
                BSP_MPU9150_REG_SMPLRT_DIV,
                samplingRateRegVal,
                &err);

        /*
         * Configuration register sets up DLPF and sampling of External FSYNC pin
         */
        if(err == BSP_MPU9150_err_NONE ) {
            // sets DLPF value
            configRegVal.B.dlpfCfg = 2u;
            configRegVal.B.extSyncSet = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_CONFIG,
                    configRegVal.R,
                    &err);
        }

        /*
         * FIFO enable register sets which sensor output will be written to FIFO buffer
         */
        if(err == BSP_MPU9150_err_NONE ) {
            fifoConfigReg.B.accelFifoEn = false;
            fifoConfigReg.B.tempFifoEn = false;
            fifoConfigReg.B.xgFifoEn = false;
            fifoConfigReg.B.ygFifoEn = false;
            fifoConfigReg.B.zgFifoEn = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_FIFO_EN,
                    fifoConfigReg.R,
                    &err);
        }

        /*
         * Interrupt configuration sets up interrupt behavior
         */
        if(err == BSP_MPU9150_err_NONE ) {
            intConfigReg.B.fsyncIntEn = false;
            intConfigReg.B.fsyncIntLevel = false;
            // if true enables I2C bypass, so we can directly access magnetometer through I2C
            intConfigReg.B.i2cBypassEn = false;
            intConfigReg.B.intLevel = false;
            intConfigReg.B.intOpen = false;
            // if true - clear interrupt status on any read operation
            intConfigReg.B.intRdClear = true;
            intConfigReg.B.latchIntEn = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_INT_PIN_CFG,
                    intConfigReg.R,
                    &err);
        }

        /*
         * Setup gyroscope configuration
         */
        if(err == BSP_MPU9150_err_NONE ) {
            gyroConfigReg.B.fsSel = (uint8_t) inDevice->config->gyroRange;
            gyroConfigReg.B.xg_st = false;
            gyroConfigReg.B.yg_st = false;
            gyroConfigReg.B.zg_st = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_GYRO_CONFIG,
                    gyroConfigReg.R,
                    &err);
        }

        /*
         * Setup accelerometer configuration
         */
        if(err == BSP_MPU9150_err_NONE ) {
            accConfigReg.B.afsSel = (uint8_t) inDevice->config->accRange;
            accConfigReg.B.xa_st = false;
            accConfigReg.B.ya_st = false;
            accConfigReg.B.za_st = false;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_ACCEL_CONFIG,
                    accConfigReg.R,
                    &err);
        }

        /* TODO: [mario.kodba 28.06.2021] Needs to be tested
         * Setup magnetometer configuration
         */
//        if(err == BSP_MPU9150_err_NONE ) {
//            BSP_MPU9150_writeSingleMagReg(inDevice,
//                    BSP_MPU9150_REG_MAG_CNTL,
//                    BSP_MPU9150_MAGNETOMETER_SINGLE_MEAS_MODE,
//                    &err);
//        }

        /*
         * Interrupt enable setup
         */
        if(err == BSP_MPU9150_err_NONE ) {
            intEnableReg.B.i2cMstIntEn = false;
            intEnableReg.B.fifoOverflowEn = false;
            // if true - enable DATA READY interrupt signal on pin
            intEnableReg.B.dataRdyEn = true;

            BSP_MPU9150_writeSingleReg(inDevice,
                    BSP_MPU9150_REG_INT_ENABLE,
                    intEnableReg.R,
                    &err);
        }
    }

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***************************************************************************************************
 *                          END OF FILE
 **************************************************************************************************/
